export interface PresetMenu {
  id: string;
  name: string;
  price: string;
  image_url?: string;
  cropped_url?: string;
}

export const presetMenus: PresetMenu[] = [
  { id: 'm1', name: 'แกงหน่อไม้เห็ดรวมผักแขยง+ไข่ต้ม', price: '70$' },
  { id: 'm2', name: 'ผัดกระหล่ำดอกใส่หมู+ไข่ต้ม', price: '70$' },
  { id: 'm3', name: 'ผัดเผ็ดกระดูกอ่อน+ไข่ต้ม', price: '70$' },
  { id: 'm4', name: 'ผัดคะน้าหมูชิ้น+ไข่ดาว', price: '70$' },
  { id: 'm5', name: 'ผัดกะเพรากุ้ง+ไข่ดาว', price: '80$' },
  { id: 'm6', name: 'ผัดเผ็ดไก่+ไข่ต้ม', price: '70$' },
  { id: 'm7', name: 'ยำหมูยอกุ้ง', price: '80$' },
  { id: 'm8', name: 'น้ำพริกกะปิปลาทู+ไข่ต้ม', price: '70$' },
  { id: 'm9', name: 'กะเพราหน่อไม้หมูสับ+ไข่ดาว', price: '70$' },
  { id: 'm10', name: 'แกงเขียวหวาน+ไข่ต้มและผัก', price: '70$' },
  { id: 'm11', name: 'ผัดเผ็ดหมูหน่อไม้ดอง+ไข่ต้ม', price: '70$' },
  { id: 'm12', name: 'ซี่โครงทอดน้ำจิ้มแจ่ว+ไข่ต้ม', price: '70$' },
  { id: 'm13', name: 'ซุปมะเขือ+ไข่ต้ม', price: '70$' },
  { id: 'm14', name: 'แกงไก่ใส่ฟัก+ไข่ต้ม', price: '70$' },
  { id: 'm15', name: 'ไก่ต้มน้ำปลา+ไข่ต้ม', price: '70$' },
  { id: 'm16', name: 'กะเพราตับไก่+ไข่ต้ม', price: '70$' },
  { id: 'm17', name: 'หมูผัดพริกหยวก+ไข่ดาว', price: '70$' },
  { id: 'm18', name: 'พะโล้หมูสามชั้น', price: '70$' },
  { id: 'm19', name: 'ผัดโหระพาไก่+ไข่ต้ม', price: '70$' },
  { id: 'm20', name: 'ซุปเห็ดรวม+ไข่ต้ม', price: '70$' },
  { id: 'm21', name: 'แพนงหมู+ไข่ต้ม', price: '70$' },
  { id: 'm22', name: 'ต้มจืดโครงหมูใส่ผักกาดดอง+ไข่ต้ม', price: '70$' },
  { id: 'm23', name: 'หมกหน่อไม้ใส่หมูสามชั้น', price: '70$' }
];
